; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=230, out_folder=./training, instance_id=11, seed=2035, goal_proportion=0.03

(define (problem blocksworld-11)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 - object)
 (:init 
    (arm-empty)
    (clear b21)
    (on b21 b229)
    (on b229 b15)
    (on b15 b97)
    (on b97 b110)
    (on b110 b143)
    (on b143 b168)
    (on b168 b5)
    (on-table b5)
    (clear b203)
    (on b203 b225)
    (on b225 b172)
    (on-table b172)
    (clear b49)
    (on b49 b137)
    (on-table b137)
    (clear b104)
    (on b104 b117)
    (on b117 b41)
    (on b41 b205)
    (on b205 b42)
    (on b42 b106)
    (on b106 b140)
    (on b140 b43)
    (on b43 b61)
    (on b61 b150)
    (on b150 b179)
    (on-table b179)
    (clear b227)
    (on b227 b100)
    (on b100 b208)
    (on b208 b30)
    (on b30 b116)
    (on-table b116)
    (clear b74)
    (on b74 b40)
    (on-table b40)
    (clear b146)
    (on b146 b86)
    (on b86 b131)
    (on-table b131)
    (clear b93)
    (on b93 b115)
    (on b115 b103)
    (on b103 b26)
    (on b26 b226)
    (on b226 b195)
    (on b195 b14)
    (on b14 b13)
    (on b13 b230)
    (on b230 b105)
    (on b105 b228)
    (on-table b228)
    (clear b149)
    (on b149 b31)
    (on-table b31)
    (clear b178)
    (on b178 b126)
    (on-table b126)
    (clear b188)
    (on b188 b92)
    (on b92 b145)
    (on b145 b22)
    (on b22 b124)
    (on b124 b84)
    (on b84 b123)
    (on b123 b136)
    (on b136 b215)
    (on b215 b120)
    (on b120 b89)
    (on b89 b36)
    (on b36 b67)
    (on-table b67)
    (clear b102)
    (on b102 b107)
    (on b107 b169)
    (on-table b169)
    (clear b85)
    (on b85 b144)
    (on b144 b206)
    (on-table b206)
    (clear b138)
    (on b138 b7)
    (on b7 b32)
    (on b32 b29)
    (on b29 b176)
    (on b176 b141)
    (on b141 b190)
    (on b190 b153)
    (on-table b153)
    (clear b24)
    (on-table b24)
    (clear b87)
    (on b87 b182)
    (on b182 b177)
    (on-table b177)
    (clear b52)
    (on b52 b59)
    (on b59 b193)
    (on-table b193)
    (clear b2)
    (on b2 b50)
    (on-table b50)
    (clear b129)
    (on b129 b184)
    (on b184 b111)
    (on b111 b35)
    (on b35 b28)
    (on b28 b214)
    (on-table b214)
    (clear b10)
    (on b10 b198)
    (on b198 b72)
    (on b72 b139)
    (on b139 b202)
    (on b202 b222)
    (on-table b222)
    (clear b135)
    (on-table b135)
    (clear b181)
    (on b181 b122)
    (on b122 b192)
    (on b192 b211)
    (on b211 b154)
    (on b154 b60)
    (on b60 b3)
    (on b3 b34)
    (on-table b34)
    (clear b167)
    (on b167 b90)
    (on b90 b51)
    (on b51 b64)
    (on-table b64)
    (clear b78)
    (on b78 b57)
    (on-table b57)
    (clear b54)
    (on b54 b174)
    (on b174 b99)
    (on b99 b156)
    (on b156 b191)
    (on-table b191)
    (clear b47)
    (on-table b47)
    (clear b83)
    (on b83 b95)
    (on b95 b114)
    (on b114 b224)
    (on b224 b219)
    (on b219 b216)
    (on b216 b113)
    (on b113 b194)
    (on b194 b164)
    (on-table b164)
    (clear b37)
    (on b37 b70)
    (on b70 b71)
    (on-table b71)
    (clear b130)
    (on b130 b199)
    (on b199 b161)
    (on b161 b91)
    (on b91 b173)
    (on b173 b200)
    (on b200 b1)
    (on b1 b119)
    (on b119 b108)
    (on b108 b63)
    (on b63 b166)
    (on-table b166)
    (clear b38)
    (on b38 b20)
    (on b20 b112)
    (on-table b112)
    (clear b147)
    (on-table b147)
    (clear b6)
    (on-table b6)
    (clear b197)
    (on b197 b163)
    (on b163 b53)
    (on b53 b58)
    (on b58 b69)
    (on-table b69)
    (clear b148)
    (on b148 b4)
    (on b4 b118)
    (on b118 b19)
    (on b19 b171)
    (on-table b171)
    (clear b101)
    (on-table b101)
    (clear b201)
    (on b201 b223)
    (on b223 b80)
    (on b80 b75)
    (on b75 b220)
    (on b220 b165)
    (on-table b165)
    (clear b175)
    (on b175 b151)
    (on b151 b76)
    (on b76 b46)
    (on b46 b11)
    (on-table b11)
    (clear b160)
    (on b160 b48)
    (on-table b48)
    (clear b212)
    (on-table b212)
    (clear b185)
    (on b185 b183)
    (on-table b183)
    (clear b162)
    (on b162 b39)
    (on b39 b133)
    (on b133 b125)
    (on b125 b88)
    (on b88 b189)
    (on b189 b33)
    (on b33 b16)
    (on b16 b155)
    (on b155 b8)
    (on b8 b157)
    (on b157 b142)
    (on b142 b217)
    (on b217 b207)
    (on-table b207)
    (clear b66)
    (on b66 b65)
    (on b65 b55)
    (on b55 b81)
    (on b81 b12)
    (on b12 b109)
    (on b109 b121)
    (on b121 b218)
    (on b218 b94)
    (on b94 b132)
    (on b132 b213)
    (on b213 b221)
    (on-table b221)
    (clear b170)
    (on b170 b73)
    (on-table b73)
    (clear b17)
    (on b17 b62)
    (on b62 b68)
    (on b68 b45)
    (on b45 b98)
    (on b98 b196)
    (on b196 b25)
    (on b25 b127)
    (on b127 b134)
    (on b134 b82)
    (on b82 b56)
    (on b56 b152)
    (on b152 b23)
    (on b23 b187)
    (on-table b187)
    (clear b210)
    (on b210 b96)
    (on b96 b27)
    (on-table b27)
    (clear b159)
    (on b159 b158)
    (on b158 b186)
    (on b186 b79)
    (on b79 b180)
    (on b180 b128)
    (on b128 b9)
    (on b9 b18)
    (on b18 b44)
    (on b44 b204)
    (on b204 b77)
    (on b77 b209)
    (on-table b209))
 (:goal  (and 
    (clear b5)
    (on b5 b1)
    (on b1 b3)
    (on-table b3)
    (clear b4)
    (on b4 b2)
    (on b2 b6)
    (on-table b6))))

; plan
1. (unstack b130 b199)
   deleted: (on b130 b199) (clear b130) (arm-empty)
   added: (holding b130) (clear b199)
   goals met: 1 of 8
2. (putdown b130)
   deleted: (holding b130)
   added: (clear b130) (arm-empty) (on-table b130)
   goals met: 1 of 8
3. (unstack b148 b4)
   deleted: (on b148 b4) (clear b148) (arm-empty)
   added: (holding b148) (clear b4)
   goals met: 2 of 8
4. (putdown b148)
   deleted: (holding b148)
   added: (clear b148) (arm-empty) (on-table b148)
   goals met: 2 of 8
5. (unstack b181 b122)
   deleted: (on b181 b122) (clear b181) (arm-empty)
   added: (holding b181) (clear b122)
   goals met: 2 of 8
6. (putdown b181)
   deleted: (holding b181)
   added: (clear b181) (arm-empty) (on-table b181)
   goals met: 2 of 8
7. (unstack b122 b192)
   deleted: (on b122 b192) (clear b122) (arm-empty)
   added: (holding b122) (clear b192)
   goals met: 2 of 8
8. (putdown b122)
   deleted: (holding b122)
   added: (clear b122) (arm-empty) (on-table b122)
   goals met: 2 of 8
9. (unstack b192 b211)
   deleted: (on b192 b211) (clear b192) (arm-empty)
   added: (holding b192) (clear b211)
   goals met: 2 of 8
10. (putdown b192)
   deleted: (holding b192)
   added: (clear b192) (arm-empty) (on-table b192)
   goals met: 2 of 8
11. (unstack b199 b161)
   deleted: (on b199 b161) (clear b199) (arm-empty)
   added: (holding b199) (clear b161)
   goals met: 2 of 8
12. (putdown b199)
   deleted: (holding b199)
   added: (clear b199) (arm-empty) (on-table b199)
   goals met: 2 of 8
13. (unstack b161 b91)
   deleted: (on b161 b91) (clear b161) (arm-empty)
   added: (holding b161) (clear b91)
   goals met: 2 of 8
14. (putdown b161)
   deleted: (holding b161)
   added: (clear b161) (arm-empty) (on-table b161)
   goals met: 2 of 8
15. (unstack b21 b229)
   deleted: (on b21 b229) (clear b21) (arm-empty)
   added: (holding b21) (clear b229)
   goals met: 2 of 8
16. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 2 of 8
17. (unstack b211 b154)
   deleted: (on b211 b154) (clear b211) (arm-empty)
   added: (holding b211) (clear b154)
   goals met: 2 of 8
18. (putdown b211)
   deleted: (holding b211)
   added: (clear b211) (arm-empty) (on-table b211)
   goals met: 2 of 8
19. (unstack b154 b60)
   deleted: (on b154 b60) (clear b154) (arm-empty)
   added: (holding b154) (clear b60)
   goals met: 2 of 8
20. (putdown b154)
   deleted: (holding b154)
   added: (clear b154) (arm-empty) (on-table b154)
   goals met: 2 of 8
21. (unstack b229 b15)
   deleted: (on b229 b15) (clear b229) (arm-empty)
   added: (holding b229) (clear b15)
   goals met: 2 of 8
22. (putdown b229)
   deleted: (holding b229)
   added: (clear b229) (arm-empty) (on-table b229)
   goals met: 2 of 8
23. (unstack b15 b97)
   deleted: (on b15 b97) (clear b15) (arm-empty)
   added: (holding b15) (clear b97)
   goals met: 2 of 8
24. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 2 of 8
25. (unstack b60 b3)
   deleted: (on b60 b3) (clear b60) (arm-empty)
   added: (holding b60) (clear b3)
   goals met: 2 of 8
26. (putdown b60)
   deleted: (holding b60)
   added: (clear b60) (arm-empty) (on-table b60)
   goals met: 2 of 8
27. (unstack b3 b34)
   deleted: (on b3 b34) (clear b3) (arm-empty)
   added: (holding b3) (clear b34)
   goals met: 2 of 8
28. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 3 of 8
29. (unstack b91 b173)
   deleted: (on b91 b173) (clear b91) (arm-empty)
   added: (holding b91) (clear b173)
   goals met: 3 of 8
30. (putdown b91)
   deleted: (holding b91)
   added: (clear b91) (arm-empty) (on-table b91)
   goals met: 3 of 8
31. (unstack b173 b200)
   deleted: (on b173 b200) (clear b173) (arm-empty)
   added: (holding b173) (clear b200)
   goals met: 3 of 8
32. (putdown b173)
   deleted: (holding b173)
   added: (clear b173) (arm-empty) (on-table b173)
   goals met: 3 of 8
33. (unstack b200 b1)
   deleted: (on b200 b1) (clear b200) (arm-empty)
   added: (holding b200) (clear b1)
   goals met: 3 of 8
34. (putdown b200)
   deleted: (holding b200)
   added: (clear b200) (arm-empty) (on-table b200)
   goals met: 3 of 8
35. (unstack b97 b110)
   deleted: (on b97 b110) (clear b97) (arm-empty)
   added: (holding b97) (clear b110)
   goals met: 3 of 8
36. (putdown b97)
   deleted: (holding b97)
   added: (clear b97) (arm-empty) (on-table b97)
   goals met: 3 of 8
37. (unstack b110 b143)
   deleted: (on b110 b143) (clear b110) (arm-empty)
   added: (holding b110) (clear b143)
   goals met: 3 of 8
38. (putdown b110)
   deleted: (holding b110)
   added: (clear b110) (arm-empty) (on-table b110)
   goals met: 3 of 8
39. (unstack b143 b168)
   deleted: (on b143 b168) (clear b143) (arm-empty)
   added: (holding b143) (clear b168)
   goals met: 3 of 8
40. (putdown b143)
   deleted: (holding b143)
   added: (clear b143) (arm-empty) (on-table b143)
   goals met: 3 of 8
41. (unstack b168 b5)
   deleted: (on b168 b5) (clear b168) (arm-empty)
   added: (holding b168) (clear b5)
   goals met: 4 of 8
42. (putdown b168)
   deleted: (holding b168)
   added: (clear b168) (arm-empty) (on-table b168)
   goals met: 4 of 8
43. (unstack b1 b119)
   deleted: (on b1 b119) (clear b1) (arm-empty)
   added: (holding b1) (clear b119)
   goals met: 4 of 8
44. (stack b1 b3)
   deleted: (clear b3) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b3)
   goals met: 5 of 8
45. (unstack b2 b50)
   deleted: (on b2 b50) (clear b2) (arm-empty)
   added: (holding b2) (clear b50)
   goals met: 5 of 8
46. (stack b2 b6)
   deleted: (clear b6) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b6)
   goals met: 6 of 8
47. (unstack b4 b118)
   deleted: (on b4 b118) (clear b4) (arm-empty)
   added: (holding b4) (clear b118)
   goals met: 5 of 8
48. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 7 of 8
49. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 6 of 8
50. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 8 of 8
